Repository: jcmh05/wordleFlutterApp
Catalog: lib/l10n/intl_*.arb
Languages: ca, zh

# boton1menu
source: WORD OF THE DAY
ca: PARAULA DEL DIA
zh: 今日之詞

# boton2menu
source: TRAINING
ca: ENTRENAMENT
zh: 訓練

# boton3menu
source: TUTORIAL
zh: 教程

# tituloEstadisticas
source: Game Statistics
ca: Estadístiques de joc
zh: 遊戲統計數據

# partidas
source: 🕹 GAMES PLAYED
ca: 🕹 PARTIDES JUGADES
zh: 🕹 遊戲局數

# ganadas
source: 🏆 GAMES WON
ca: 🏆 PARTIDES GUANYADES
zh: 🏆 獲勝局數

# porcentaje
source: 📈 VICTORIES (%)
ca: 📈 VICTÒRIES (%)
zh: 📈 勝率(%)

# perdidas
source: 🥀 GAMES LOST
ca: 🥀 PARTIDES PERDUDES
zh: 🥀 失敗局數

# racha
source: 🔥 CURRENT STREAK
ca: 🔥 RATXA ACTUAL
zh: 🔥 目前連勝

# mejorRacha
source: ⚡ BEST STREAK
ca: ⚡ MILLOR RATXA
zh: ⚡ 最佳連勝

# tituloTop
source: Top Games
ca: Millors Partides
zh: 最佳遊戲

# botonFormateo
source: Format Stats
ca: Formatejar estadístiques
zh: 格式化統計數據

# confirmarFormateo
source: Stats Erased
ca: Estadístiques esborrades
zh: 統計數據已刪除

# cerrar
source: Close
ca: Tancar
zh: 關閉

# compartir
source: Share
ca: Compartir
zh: 分享

# enviar
source: SEND
ca: ENVIAR
zh: 發送

# palabraInexistente
source: is not in our dictionary
ca: no està en el nostre diccionari
zh: 不在詞典中

# palabraInsuficiente
source: Not enough letters
ca: No hi ha suficients lletres
zh: 字母不足

# tituloVictoria
source: You won! 🏆
ca: Has guanyat! 🏆
zh: 你贏了! 🏆

# tituloDerrota
source: You lost! 😢
ca: Has perdut! 😢
zh: 你輸了! 😢

# textoDerrota
source: The word was:
ca: La paraula era:
zh: 該單詞是:

# textoVictoria
source: Congratulations! Share the result with all your friends
ca: Felicitats! Comparteix el resultat amb tots els teus amics
zh: 恭喜你! 與您的所有朋友分享結果

# textoVictoriaEntrenamiento
source: Congratulations! Play again as much as you want
ca: Felicitats! Torna a jugar tantes vegades com vulguis
zh: 恭喜！ 隨時再玩

# avisoEstadisticas
source: Statistics are only stored for games played in the word of the day
ca: Només s'emmagatzemen les estadístiques de les partides jugades en la paraula del dia
zh: 僅儲存在每日單詞中玩的遊戲統計數據

# volverAlMenu
source: Back to menu
ca: Tornar al menú
zh: 返回菜單

# ajustes
source: Settings
ca: Configuració
zh: 設定

# sonidosInterfaz
source: 📱 Interface sounds
ca: 📱 Sons de la interfície
zh: 📱 介面音效

# sonidosTeclado
source: ⌨ Keyboard sounds
ca: ⌨ Sons del teclat
zh: ⌨ 鍵盤音效

# musica
source: 🎵 Music
ca: 🎵 Música
zh: 🎵 音樂

# volumenMusica
source: Music volume:
ca: Volum de música:
zh: 音樂音量：

# cancion
source: Selected song:
ca: Cançó seleccionada:
zh: 已選歌曲：

# cancionHint
source: Select a song
ca: Selecciona una cançó
zh: 選擇一首歌曲

# modo4
source: MODE 4
zh: 模式4

# modo5
source: CLASSIC
ca: CLÀSSIC
zh: 经典

# modo6
source: MODE 6
zh: 模式6

# textoEntrenamiento
source: Practice unlimitedly!
ca: ¡Practica sense límits!
zh: 無限練習！

# tutorialTitulo
source: HOW TO PLAY
ca: COM JUGAR
zh: 如何遊玩

# tutorialTexto
source: The game consists of guessing the hidden word. The word changes every day and will always be the same for everyone. Each attempt must be a valid word. When entering a word, each letter is colored based on whether it is present or not in the word, and whether it is in the correct position.
ca: El joc consisteix a endevinar la paraula amagada. La paraula canvia cada dia i sempre serà la mateixa per a totes les persones. Cada intent ha de ser una paraula vàlida. En introduir una paraula, cada lletra es pinta d'un color en funció de si es troba o no en la paraula i si es troba en la posició correcta
zh: 遊戲的目標是猜測隱藏的單詞。每天更換一個單詞，對於每個人來說都是相同的。 每次嘗試都必須是一個有效的單詞。輸入單詞時，根據字母是否存在於單詞中，以及是否位於正確的位置，對每個字母進行著色。

# tutorialVerde
source: GREEN means the letter is in the word and is in the CORRECT position
ca: VERD significa que la lletra es troba a la paraula i està a la posició CORRECTA
zh: 綠色表示該字母在單詞中並且位於正確的位置

# tutorialAmarillo
source: YELLOW means the letter is present in the word but is in the WRONG position
ca: GROC significa que la lletra és present a la paraula però està a la posició INCORRECTA
zh: 黃色表示該字母在單詞中存在，但位於錯誤的位置

# tutorialGris
source: GRAY means the letter is NOT present in the word
ca: GRIS significa que la lletra NO és present a la paraula
zh: 灰色表示該字母不在單詞中
